# language: bg
Функционалност: Активност
  За да може преподавателите да следят активността по решенията на текущите задачи
  като преподавателски екип
  искаме да има страница, показваща тази активност

  Сценарий: показване на RSS Feed линк
    Дадено че съм влязъл като администратор
    Когато отида на страницата с активността
    То трябва да виждам картинка с алтернативен текст "Абонирайте се за RSS Feed към тази страница"

  Сценарий: отваряне на RSS линк
    Дадено че съм влязъл като администратор
    Когато отида на страницата с активността
    И проследя "Абонирайте се за RSS Feed към тази страница"
    То трябва да съм на RSS адреса на страницата с активността

  Сценарий: достъп до RSS Feed
    Дадено че съм студент
    Когато отида на RSS адреса на страницата с активността
    То трябва да виждам "Нямате достъп до тази страница"

  Сценарий: показване на RSS Feed
    Дадено че съм влязъл като администратор
    И че "Първа задача" има следните решения:
      | Студент      | Успешни | Неуспешни | Код             |
      | Петър Петров | 12      | 6         | print("larodi") |
      | Иван Иванов  | 18      | 0         | print("baba")   |
    И следните коментари към решението на "Петър Петров"
      | Студент       | Коментар         |
      | Джаста Праста | става            |
      | Иван Иванов   | аууу, много зле! |
    И следните коментари към решението на "Иван Иванов"
      | Студент       | Коментар         |
      | Джаста Праста | Брау!            |
    Когато отида на RSS адреса на страницата с активността
    То трябва да виждам "Програмиране с Python :: Активност"
    И трябва да виждам следните feeds:
      | Заглавие                                                 |
      | Петър Петров предаде решение на Първа задача             |
      | Иван Иванов предаде решение на Първа задача              |
      | Джаста Праста остави коментар на решение на Първа задача |
      | Иван Иванов остави коментар на решение на Първа задача   |
      | Джаста Праста остави коментар на решение на Първа задача |
