# language: bg
Функционалност: Новини
  За да може студентите да знаят какво се случва в курса
  като преподавателски екип
  искаме да можем да публикуваме новини на сайта

  Сценарий: Публикуване на новина
    Дадено че съм влязъл като администратор
    Когато отида на новините
    И проследя "Нова"
    И попълня:
      | Заглавие | Вторник                           |
      | Тяло     | Няма да правим лекция във вторник |
    И натисна "Публикувай"
    То трябва да съществува новина "Вторник"

  Сценарий: Редактиране на новина
    Дадено че съм влязъл като администратор
    И че съществува новина:
      | Заглавие | Вторник                           |
      | Тяло     | Няма да правим лекция във вторник |
    Когато отида на новините
    И проследя "Редактирай"
    И попълня "Заглавие" със "Сряда"
    И натисна "Запази"
    То трябва да съм на новините
    И трябва да виждам "Сряда"

  Сценарий: показване на RSS Feed линк
    Дадено че съм влязъл като студент
    Когато отида на новините
    То трябва да виждам картинка с алтернативен текст "Абонирайте се за RSS Feed към тази страница"

  Сценарий: отваряне на RSS линк
    Дадено че съм влязъл като студент
    Когато отида на новините
    И проследя "Абонирайте се за RSS Feed към тази страница"
    То трябва да съм на RSS адреса на новините
