# language: bg
Функционалност: Признания
  Когато студентите направят нещо яко в GitHub, ние искаме да ги признаем с
  точка. В момента правим това с размяна на ваучери. Това ни занимава и нас и
  студентите. Искаме да имаме по-лесен начин да направим това.

  Предистория:
    Дадено че съм влязъл като администратор

  Сценарий: Добавяне на признание
    Дадено че студент "Петър Петров" е направил нещо яко
    Когато дам признание на студент "Петър Петров"
    То "Петър Петров" трябва да има "1" точка
