# language: bg
Функционалност: Коментари
  За да научат студентите повече, искаме да можем да коментираме по техните решения. За да
  насърчим интеракция помежду им, искаме да могат да оставят коментари един на друг и да
  получават допълнителни точки за това.

  Сценарий: Коментиране на решение
    Дадено че студент "Иван Иванов" е предал решение на задача "Първа задача"
    И че съм влязъл като администратор
    Когато коментирам решението на "Иван Иванов" с:
      """
      Много добре!
      """
    То трябва да виждам коментар "Много добре!"

  Сценарий: Коментиране на собствено решение преди крайния срок
    Дадено че съм студент
    И че съм предал решение на текуща задача
    Когато коментирам решението си с:
      """
      Това добра идея ли е?
      """
    То трябва да виждам коментар "Това добра идея ли е?"

  Сценарий: Публикуване на невалиден коментар
    Дадено че студент "Иван Иванов" е предал решение на задача "Първа задача"
    И че съм влязъл като администратор
    Когато опитам да оставя празен коментар на решението на "Иван Иванов"
    То трябва да видя, че не мога да публикувам празни коментари

  Сценарий: Редактиране на коментар
    Дадено че съм влязъл като студент
    И че имам коментар на чуждо решение
    Когато променя коментара си на "Хм, май размислих"
    То трябва да виждам коментар "Хм, май размислих"

  Сценарий: Получаване на писмо при коментар на мое решение
    Дадено че съм влязъл като студент
    И че съм предал решение на "Първа задача"
    Когато някой коментира решението ми на "Първа задача"
    То трябва да получа писмо, че има нов коментар на решението ми

  Сценарий: Разглеждане на историята на едно решение
    Дадено че съм влязъл като студент
    И решението ми на "Първа задача" има следната история:
      | Версия   | puts 1                        |
      | Коментар | Работи в много частни случаи  |
      | Коментар | Не ми харесва                 |
      | Версия   | puts 2                        |
      | Коментар | Така изглежда доста по-добре! |
    Когато отворя публичната страница на решението ми на "Първа задача"
    То трябва да виждам версия "puts 1"
    И трябва да виждам коментар "Работи в много частни случаи" за "puts 1"
    И трябва да виждам коментар "Не ми харесва" за "puts 1"
    И трябва да виждам версия "puts 2"
    И трябва да виждам коментар "Така изглежда доста по-добре!" за "puts 2"
