# language: bg
Функционалност: Коментари
  За да научат студентите повеже, искаме да можем да коментираме по техните решения. За да
  насърчим интеракция помежду им, искаме да могат да оставят коментари един на друг и да
  получават допълнителни точки за това.

  Сценарий: Коментиране на решение
    Дадено че студент "Иван Иванов" е предал решение на задача "Първа задача"
    И че съм влязъл като администратор
    Когато коментирам решението на "Иван Иванов" с:
      """
      Много добре!
      """
    То трябва да виждам коментар "Много добре!"
