# language: bg
Функционалност: Коментари
  За да научат студентите повече, искаме да можем да коментираме по техните решения. За да
  насърчим интеракция помежду им, искаме да могат да оставят коментари един на друг и да
  получават допълнителни точки за това.

  Сценарий: Коментиране на решение
    Дадено че студент "Иван Иванов" е предал решение на задача "Първа задача"
    И че съм влязъл като администратор
    Когато коментирам решението на "Иван Иванов" с:
      """
      Много добре!
      """
    То трябва да виждам коментар "Много добре!"

  Сценарий: Публикуване на невалиден коментар
    Дадено че студент "Иван Иванов" е предал решение на задача "Първа задача"
    И че съм влязъл като администратор
    Когато опитам да оставя празен коментар на решението на "Иван Иванов"
    То трябва да видя, че не мога да публикувам празни коментари

  Сценарий: Редактиране на коментар
    Дадено че съм влязъл като студент
    И че имам коментар на чуждо решение
    Когато променя коментара си на "Хм, май размислих"
    То трябва да виждам коментар "Хм, май размислих"

  Сценарий: Получаване на писмо при коментар на мое решение
    Дадено че съм влязъл като студент
    И че съм предал решение на "Първа задача"
    Когато някой коментира решението ми на "Първа задача"
    То трябва да получа писмо, че има нов коментар на решението ми
