# language: bg
Функционалност: Забравена парола
  За да може да не се логваме на сървъра всеки път, когато някой разсеян
  студент си е забравил паролата, искаме всеки от тях да може да си поиска
  нова през уеб интерфейса на приложението.

  Сценарий: Смяна на забравена парола
    Дадено че имам потребител "absent.minded@example.org"
    Когато попълня формата за забравена парола на "absent.minded@example.org"
    И проследя линка в последния си мейл
    И въведа нова парола и потвърждение "never forget"
    То мога да вляза с адрес "absent.minded@example.org" и парола "never forget"
