# language: bg
Функционалност: Форуми
  За да мога да науча повече, да споделя нещо интересно или да задам въпрос
  като студент
  искам да мога да участвам в дискусионен форум с преподавателите и другите студенти

  Сценарий: Разглеждане на теми
    Дадено че съществува тема "Въпрос"
    И че темата "Въпрос" има "1" отговора, последния от които на "Петър Петров"
    Когато отида на заглавната страница на форумите
    То трябва да виждам следните теми:
      | Тема   | Отговори | Последен отговор от |
      | Въпрос | 1        | Петър Петров        |

  Сценарий: Създаване на тема
    Дадено че съм студент
    Когато отида на заглавната страница на форумите
    И проследя "Нова тема"
    И попълня:
      | Заглавие   | Моята тема           |
      | Съдържание | Текста на моята тема |
    И натисна "Публикувай"
    То трябва да съм на темата "Моята тема"
    И трябва да виждам "Текста на моята тема"

  Сценарий: Отговаряне на тема
    Дадено че съм студент
    И че съществува тема "Любопитен въпрос"
    Когато отида на темата "Любопитен въпрос"
    И попълня "Отговор" с "Моят отговор"
    И натисна "Отговори"
    То трябва да съм на темата "Любопитен въпрос"
    И трябва да виждам "Моят отговор"

  Сценарий: Редактиране на тема
    Дадено че съм студент
    И че имам тема "Някакъв въпрос"
    Когато отида на темата "Някакъв въпрос"
    И започна да редактирам темата
    И попълня "Заглавие" с "новото ми заглавие"
    И попълня "Съдържание" с "новото ми съдържание"
    И натисна "Обнови"
    То трябва да съм на темата "новото ми заглавие"
    И трябва да виждам "новото ми съдържание"

  Сценарий: Редактиране на отговор
    Дадено че съм студент
    И че съществува тема "Въпрос"
    И че съм отговорил на "Въпрос" с "моя отговор"
    Когато отида на темата "Въпрос"
    И започна да редактирам отговорът "моя отговор"
    И попълня "Отговор" с "новия ми отговор"
    И натисна "Обнови"
    То трябва да съм на темата "Въпрос"
    И трябва да виждам "новия ми отговор"

  Сценарий: Опит за редакция на чужда тема
    Дадено че съм студент
    И че съществува тема "Любопитен въпрос"
    Когато отида на редакцията на тема "Любопитен въпрос"
    То трябва да виждам "Нямате достъп до тази страница"

  Сценарий: Опит за публикуване на зловредно съдържание
    Дадено че съществува тема "Опит за XSS" със съдържание:
      """
      <a href="#" onclick="maliciousCode()">Цъкни тук за нещо яко!</a>
      """
    Когато отида на темата "Опит за XSS"
    То трябва да няма "maliciousCode()" в кода на документа

