# language: bg
Функционалност: Известия
  Студентите получават известия, когато бъде публикувана задача,
  предизвикателсвто или отговор във форум тема

  Сценарий: Получаване на известие при публикуване на задача
    Дадено че съм влязъл като администратор
    Когато създам задача:
      | Име     | Първа задача      |
      | Условие | Напишете програма |
    То трябва да съществува известие "Нова задача: Първа задача"

  Сценарий: Получаване на известие при публикуване на предизвикателство
    Дадено че съм влязъл като администратор
    Когато създам предизвикателство "Четене на субтитри"
    То трябва да съществува известие "Новo предизвикателство: Четене на субтитри"

  Сценарий: Получаване на известие при публикуване на отговор в тема
    Дадено че съм студент
    Дадено че съществува тема "Въпрос"
    И че темата "Въпрос" има "1" отговора, последния от които на "Петър Петров"
    Когато отговоря на "Въпрос" с:
      """
      Моят текст
      """
    То трябва да съществува известие "Нов отговор в тема: Въпрос"

  Сценарий: Потребителите виждат само непрочетени известия
    Дадено че съм студент
    Дадено че съществува известие "Прочетено известие"
    Дадено че съществува непрочетено известие "Ново непрочетено известие"
    Когато отворя страницата с известията
    То трябва да виждам известие "Ново непрочетено известие"
    И трябва да не виждам известие "Прочетено известие"
    И броя на новите известия трябва да е 1

  Сценарий: Когато избера ново известие съм пренасочен към страницата на първоизточника
    Дадено че съм влязъл като администратор
    Когато създам задача:
      | Име     | Първа задача      |
      | Условие | Напишете програма |
    И отворя страницата с известията
    И избера известието "Нова задача: Първа задача"
    То трябва да съм на задачата "Първа задача"
    И броя на новите известия трябва да е 0