# language: bg
Функционалност: Новини
  За да може студентите да знаят какво се случва в курса
  като преподавателски екип
  искаме да можем да публикуваме новини на сайта

  Сценарий: Отговаряне на анкета
    Дадено че съм студент
    И че съществува анкета:
      """
      - name: main_language
        type: single-line
        text: Кой е основния ви език за програмиране?
      - name: editor
        type: multi-line
        text: Какъв текстов редактор ползвате?
      """
    Когато попълня анкетата с:
      | Въпрос                                  | Отговор |
      | Кой е основния ви език за програмиране? | Ruby    |
      | Какъв текстов редактор ползвате?        | Vim     |
    То моите отговори трябва да бъдат:
      """
      main_language: Ruby
      editor: Vim
      """

  Сценарий: Редактиране на отговор на анкета
    Дадено че съм студент
    И че съществува анкета:
      """
      - name: main_language
        type: single-line
        text: Кой е основния ви език за програмиране?
      - name: editor
        type: multi-line
        text: Какъв текстов редактор ползвате?
      """
    И че съм отговорил на анкетата с:
      """
      main_language: Ruby
      editor: Vim
      """
    Когато попълня анкетата с:
      | Въпрос                                  | Отговор |
      | Какъв текстов редактор ползвате?        | Emacs   |
    То моите отговори трябва да бъдат:
      """
      main_language: Ruby
      editor: Emacs
      """
