# language: bg
Функционалност: RSS Feeds
  За да може и по-мързеливите студенти да разбират когато има обновяване в някоя от секциите на сайта
  като един от тези клети хора
  искам да предоставя възможност за абониране за RSS Feeds към въпросните секции

  Сценарий: RSS Feed в секция Новини
    Дадено имам достъп до секция Новини
    Когато посетя секция Новини
    То трябва да виждам картинка с алтернативен текст "Абонирайте се за RSS Feed към тази страница"
    И трябва да има линк "rss_feed" към announcements.rss

