# language: bg
Функционалност: Хитринки
  В езика има ред интересни неща като малки функции или интересни модули, за които няма
  време на лекции или формата не е твърде подходящ. За да може да ги споделяме със студентите,
  искаме да ги публикуваме на малки хапки на сайта. "Хитринките" не са непременно хитри,
  но всяка от тях трябва да показва нещо интересно, като например collections.OrderedDict
  в Python, juxt в Clojure или BigDecimal в Ruby.

  Второстепенна цел е студентите да посещават сайта по редовно. За целта ни трябва редовен
  поток от нови неща, които да се набиват на очи (заглавието на хитринката трябва да се
  вижда в хедъра или на ключови страници като заглавната и таблото). Администраторите
  трябва да могат да пускат хитринки на големи порции и да определят кога всяка от тях
  да стане публична. Не е задължително всеки ден на има нова хитринка, макар това да би
  било хубаво.

  Хитринките трябва да бъдат малки и кратки. Всяка има заглавие и кратък текст, който се
  прочита и осмисля за около минута. Повечето имат линкове към подходящ ресурс -
  документация, блог пост или проект в GitHub.

  Сценарий: Добавяне на хитринка
    Администратор може да създаде нова хитринка и да определи кога тя да стане
    публична.

    Дадено че съм влязъл като администратор
    Когато създам нова хитринка:
      | Заглавие    | Числа с неограничена точност   |
      | Тяло        | Може да ползвате BigDecimal... |
      | Публична от | 2 days from now                |
    То трябва да съществува хитринка "Числа с неограничена точност"
