# language: bg
Функционалност: Ваучъри
  За да може да възнаграждаваме студентите, участващи в час
  като преподавателски екип
  искаме да им дадем възможност да печелят точки от ваучър кодове, залепени
  на разнообразни лакомства с които ги замеряме

  Сценарий: Създаване на ваучър кодове
    Дадено че съм влязъл като администратор
    Когато добавя следните ваучъри:
      """
      1111
      2222
      3333
      """
    То трябва да съществуват следните ваучъри:
      | 1111 |
      | 2222 |
      | 3333 |

  Сценарий: Вземане на ваучър
    Дадено че съм студент
    И че съществува свободен ваучър "1111"
    Когато въведа ваучър "1111"
    То трябва да имам "1" точка от ваучъри
