# language: bg
Функционалност: Ваучъри
  За да може да възнаграждаваме студентите, участващи в час
  като преподавателски екип
  искаме да им дадем възможност да печелят точки от ваучер кодове, залепени
  на разнообразни лакомства с които ги замеряме

  Сценарий: Създаване на ваучер кодове
    Дадено че съм влязъл като администратор
    Когато добавя следните ваучери:
      """
      1111
      2222
      3333
      """
    То трябва да съществуват следните ваучери:
      | 1111 |
      | 2222 |
      | 3333 |

  Сценарий: Вземане на ваучер
    Дадено че съм студент
    И че съществува свободен ваучер "1111"
    Когато въведа ваучер "1111"
    То трябва да имам "1" точка от ваучери
