# language: bg
Функционалност: Ваучъри
  За да може да възнаграждаваме студентите, участващи в час
  като преподавателски екип
  искаме да им дадем възможност да печелят точки от ваучър кодове, залепени
  на разнообразни лакомства с които ги замеряме

  Сценарий: Създаване на ваучър кодове
    Дадено че съм влязъл като администратор
    Когато отида на списъка с ваучъри
    И проследя "Добави нови ваучъри"
    И попълня "Кодове" с:
      """
      1111
      2222
      3333
      """
    И натисна "Създай"
    То трябва да съм на списъка с ваучъри
    И трябва да виждам следните ваучъри:
      | Код  |
      | 1111 |
      | 2222 |
      | 3333 |
